app/views/generic/_banner_2.html.haml

.half_banner_wrapper.shadow.pad_10
  = link_to image_tag("/images/buca_banner.jpg", :alt => "Buca"), new_organization_path(Organization.find_by_name("Planet Hollywood International/Buca Di Beppo")), :class => "half_banner_wrapper"
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."name" = 'Planet Hollywood International/Buca Di Beppo' ORDER BY Organizations.name ASC LIMIT 1