app/views/generic/_banner_1.html.haml

SELECT "organizations".* FROM "organizations" WHERE "organizations"."name" = 'Dallas Convention & Visitors Bureau' ORDER BY Organizations.name ASC LIMIT 1
---
    %div{:data => {:duration => 20000}}
      = link_to image_tag("/images/dallas_cvb.gif", :alt => "Dallas"), new_organization_path(Organization.find_by_name("Dallas Convention & Visitors Bureau")), :class => "half_banner_wrapper"

SELECT "organizations".* FROM "organizations" INNER JOIN "roles" ON "organizations".id = "roles".organization_id WHERE (("roles".user_id = 13)) AND (roles.is_user_approved = 'true') ORDER BY Organizations.name ASC
SELECT COUNT(*) FROM "organizations"
---
      - pass = ""
      - for organization in current_user.organizations.where("roles.is_user_approved = ?","true").uniq do
        = pass = true if organization.categories.any? {|c| c.tipe != "provider"}
        - if !current_user.organizations.empty? && pass == true
          .demo_banner_wrapper{:data => {:duration => 20000}}
            .banner_margin