app/views/generic/_organization_ticker.html.haml

  = javascript_include_tag 'tweets'
- orgs = Organization.where("updated_at > ? AND owner_id IS NOT NULL", 5.days.ago).order("updated_at DESC").limit(10)
---
SELECT "organizations".* FROM "organizations" WHERE (updated_at > '2011-05-26 04:39:58.726826' AND owner_id IS NOT NULL) ORDER BY Organizations.name ASC, updated_at DESC LIMIT 10