app/views/users/index.html.haml

                    .even_smaller
                      = link_to "Upgrade Your Account To Invite #{user.name_first} To Join The #{organization.name} Team", subscriptions_organization_path(organization) unless user.organizations.find_by_id(organization.id)
---
SELECT COUNT(*) FROM "organizations" INNER JOIN "roles" ON "organizations".id = "roles".organization_id WHERE (("roles".user_id = 13))