app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."name" = 'Dallas Convention & Visitors Bureau' ORDER BY Organizations.name ASC LIMIT 1
SELECT COUNT(*) FROM "organizations"
---
  def index
    @association = Organization.where('id = ?', params[:association_id]).first unless params[:association_id].nil?
    if params[:letter].present? || params[:search].present?
      organization_search
      Rails.logger.debug "START **********************************************************************"
      Rails.logger.debug @search_results.inspect

      if @organizations.blank? && params[:search] && @search_results.spellcheck_collation(params[:search]).present?
        @misspelled_query = params[:search].dup
        params[:search] = @search_results.spellcheck_collation(params[:search])
        params[:letter] = nil
        organization_search
      end
    elsif @association.member_count < 101
      @organizations = @association.members.paginate(:page => params[:page], :order => 'name DESC')