app/controllers/pages_controller.rb

  def show
    if params[:permalink]
      @page = Page.find_by_permalink(params[:permalink])
---
SELECT "pages".* FROM "pages" WHERE "pages"."permalink" = 'know_more' LIMIT 1