app/views/organizations/_admin_details.html.haml

SELECT COUNT(*) FROM "roles" WHERE ("roles".organization_id = NULL)
---
- if f.object.roles.count > 1