app/views/organizations/_membership_details.html.haml

- denied_memberships = @organization.association_memberships.where(:is_organization_approved => false).map {|m| m.organization_id}
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."is_organization_approved" = 'f' AND ("memberships".member_id = NULL)