app/views/organizations/new_interview.html.haml

SELECT COUNT(*) FROM "organizations" INNER JOIN "roles" ON "organizations".id = "roles".organization_id WHERE (("roles".user_id = 13))
---

    $('#organization_name').bind('blur', function() {
      $(this).addClass('ui-autocomplete-loading');
      var name = $(this).val();
      $('form.organization .suggestion.name').load('/organizations.js?per_page=10&search='+escape(name), function() {
        $('#organization_name').removeClass('ui-autocomplete-loading');
      });
    });